Table of Contents
 Enum ExposureClassEc2
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Type of exposure class
public enum ExposureClassEc2
Fields
X0 = 0
No risk of corrosion or attack - very dry
XA1 = 15
Chemical attack - slightly aggressive chemical environment according to EN 206-1, Table 2
XA2 = 16
Chemical attack - moderately aggressive chemical environment according to EN 206-1, Table 2
XA3 = 17
Chemical attack - highly aggressive chemical environment according to EN 206-1, Table 2
XC1 = 1
Corrosion induced by carbonation - dry or permanently wet
XC2 = 2
Corrosion induced by carbonation - wet, rarely dry
XC3 = 3
Corrosion induced by carbonation - moderate humidity
XC4 = 4
Corrosion induced by carbonation - cyclic wet and dry
XD1 = 5
Corrosion induced by chlorides - moderate humidity
XD2 = 6
Corrosion induced by chlorides - wet, rarely dry
XD3 = 7
Corrosion induced by chlorides - cyclic wet and dry
XF1 = 11
Freeze/Thaw Attack - moderate water saturation, without de-icing agent
XF2 = 12
Freeze/Thaw Attack - moderate water saturation, with de-icing agent
XF3 = 13
Freeze/Thaw Attack - high water saturation, without de-icing agents
XF4 = 14
Freeze/Thaw Attack - high water saturation with de-icing agents or sea water
XS1 = 8
Corrosion induced by chlorides from sea water - exposed to airborne salt but not in direct contact with sea water
XS2 = 9
Corrosion induced by chlorides from sea water - permanently submerged
XS3 = 10
Corrosion induced by chlorides from sea water - tidal, splash and spray zones
Fields
 Name |  Description
 X0 = 0
No risk of corrosion or attack - very dry
 XA1 = 15
Chemical attack - slightly aggressive chemical environment according to EN 206-1, Table 2
 XA2 = 16
Chemical attack - moderately aggressive chemical environment according to EN 206-1, Table 2
 XA3 = 17
Chemical attack - highly aggressive chemical environment according to EN 206-1, Table 2
 XC1 = 1
Corrosion induced by carbonation - dry or permanently wet
 XC2 = 2
Corrosion induced by carbonation - wet, rarely dry
 XC3 = 3
Corrosion induced by carbonation - moderate humidity
 XC4 = 4
Corrosion induced by carbonation - cyclic wet and dry
 XD1 = 5
Corrosion induced by chlorides - moderate humidity
 XD2 = 6
Corrosion induced by chlorides - wet, rarely dry
 XD3 = 7
Corrosion induced by chlorides - cyclic wet and dry
 XF1 = 11
Freeze/Thaw Attack - moderate water saturation, without de-icing agent
 XF2 = 12
Freeze/Thaw Attack - moderate water saturation, with de-icing agent
 XF3 = 13
Freeze/Thaw Attack - high water saturation, without de-icing agents
 XF4 = 14
Freeze/Thaw Attack - high water saturation with de-icing agents or sea water
 XS1 = 8
Corrosion induced by chlorides from sea water - exposed to airborne salt but not in direct contact with sea water
 XS2 = 9
Corrosion induced by chlorides from sea water - permanently submerged
 XS3 = 10
Corrosion induced by chlorides from sea water - tidal, splash and spray zones
 Edit this page